emacs/myconfig.org
My personal config.

* General settings

** Don't show startup message
   #+BEGIN_SRC emacs-lisp
   (setq inhibit-startup-message t)
   #+END_SRC

** Hide toolbar
   #+BEGIN_SRC emacs-lisp
   (tool-bar-mode -1)
   #+END_SRC

** Hide menu bar
   #+BEGIN_SRC emacs-lisp
   (menu-bar-mode -1)
   #+END_SRC

** Hide scrollbar
   #+BEGIN_SRC emacs-lisp
   (scroll-bar-mode -1)
   #+END_SRC

** Highlight mode (bug)
   #+BEGIN_SRC emacs-lisp
   (global-hl-line-mode +1)
   #+END_SRC

** Delete selection mode
   #+BEGIN_SRC emacs-lisp
   (delete-selection-mode 1)
   #+END_SRC

** Save backup directory
   #+BEGIN_SRC emacs-lisp
   (setq backup-directory-alist '(("." . "~/.saves")))
   #+END_SRC

** Display line numbers (on prog-mode)
   #+BEGIN_SRC emacs-lisp
   (add-hook 'prog-mode-hook 'display-line-numbers-mode)
   #+END_SRC

** Show matching parenthesis
   #+BEGIN_SRC emacs-lisp
   (show-paren-mode 1)
   #+END_SRC
   
** Indent src block
   #+BEGIN_SRC emacs-lisp
   (setq org-src-tab-acts-natively t)
   #+END_SRC

** Bookmarks
   #+BEGIN_SRC emacs-lisp
     (setq bookmark-default-file "~/.emacs.d/my-bookmarks")
     ;; save bookmark file (1 = every change)
     (setq bookmark-save-flag 1)
   #+END_SRC

** Disable ringbell
   #+BEGIN_SRC emacs-lisp
   (setq ring-bell-function 'ignore)
   #+END_SRC

** Default launch path
   #+BEGIN_SRC emacs-lisp
   (cd "e:/programing/")
   #+END_SRC

* UI

** Doom theme
   #+BEGIN_SRC emacs-lisp   
     (use-package doom-themes
       :ensure t
       :config
       (load-theme 'doom-acario-dark t))
   #+END_SRC

** Doom modeline
   #+BEGIN_SRC emacs-lisp
     (use-package doom-modeline
       :ensure t
       :hook (after-init . doom-modeline-mode))
   #+END_SRC

** All the icons
   #+BEGIN_SRC emacs-lisp
   (use-package all-the-icons
   :ensure t)
   #+END_SRC
   
** Font default
   #+BEGIN_SRC emacs-lisp
   (set-face-attribute 'default nil
                    :family "Hack"
                    :height 110
                    :weight 'normal
                    :width 'normal)
   #+END_SRC

* Modes

** IDO
   #+BEGIN_SRC emacs-lisp
   (setq ido-everywhere t)
   (setq ido-enable-flex-matching t)
   (ido-mode t)
   #+END_SRC

** RJSX
   #+BEGIN_SRC emacs-lisp
   (use-package rjsx-mode
   :ensure t
   :mode "\\.js\\'"
   :config
   (setq js-indent-level 2))
   #+END_SRC

* General packages
** Projectile
   #+BEGIN_SRC emacs-lisp
   (use-package projectile
   :ensure t
   :config
   (define-key projectile-mode-map (kbd "C-x p") 'projectile-command-map)
   (projectile-mode +1))
   #+END_SRC

** Dashboard
   #+BEGIN_SRC emacs-lisp
   (use-package dashboard
   :ensure t
   :init
   (progn
   (setq dashboard-items '((recents . 1)
   (projects . 1)
   (bookmarks . 2)))
   ;; (setq dashboard-show-shortcuts nil) to hide shortcuts
   (setq dashboard-banner-logo-title "You are now entering the matrix.")
   (setq dashboard-set-file-icons t)
   (setq dashboard-set-heading-icons t)
   ;; (setq dashboard-startup-banner "C:/PathToImg.png")
   )
  :config
  (dashboard-setup-startup-hook))
   #+END_SRC

** Treemacs
   #+BEGIN_SRC emacs-lisp
   (use-package treemacs
  :ensure t
  :bind
  (:map global-map
	([f8] . treemacs)
	("C-<f8>" . treemacs-select-window))
  :config
  (setq treemacs-is-nver-other-window t))
   #+END_SRC

** Projectile treemacs
   #+BEGIN_SRC emacs-lisp
   (use-package treemacs-projectile
  :after treemacs projectile
  :ensure t)
   #+END_SRC

** Which key
   #+BEGIN_SRC emacs-lisp
   (use-package which-key
  :ensure t
  :config (which-key-mode))
   #+END_SRC

** Expand region
   #+BEGIN_SRC emacs-lisp
   (use-package expand-region
  :ensure t
  :bind
  ("C-=" . er/expand-region)
  ("C--" . er/contract-region))
   #+END_SRC

** Company 
   #+BEGIN_SRC emacs-lisp
   (use-package company
  :ensure t
  :init
  (add-hook 'after-init-hook 'global-company-mode))
   #+END_SRC

** Flycheck
   #+BEGIN_SRC emacs-lisp
   (use-package flycheck
  :ensure t
  :init
  (global-flycheck-mode))
   #+END_SRC

** Tide
   #+BEGIN_SRC emacs-lisp
   (defun setup-tide-mode()
  "Setup function for tide."
  (interactive)
  (tide-setup)
  (flycheck-mode +1)
  (setq flycheck-check-syntax-automatically '(save mode-enabled))
  (tide-hl-identifier-mode +1)
  (company-mode +1))

;; needs typescript installed globally
(use-package tide
  :ensure t
  :after (rjsx-mode company flycheck)
  :hook (rjsx-mode . setup-tide-mode))
   #+END_SRC
   
** Prettier js
   #+BEGIN_SRC emacs-lisp
   (use-package prettier-js
  :ensure t
  :after (rjsx-mode)
  :hook (rjsx-mode . prettier-js-mode))
   #+END_SRC

** Org bullets
   #+BEGIN_SRC emacs-lisp
   (use-package org-bullets
  :ensure t
  :config
  (add-hook 'org-mode-hook (lambda () (org-bullets-mode 1))))
(setq org-support-shift-select t)
   #+END_SRC


** HTMLIZE (Org)
   #+BEGIN_SRC emacs-lisp
   (use-package htmlize
  :ensure t)
   #+END_SRC
** Buffer move
   #+BEGIN_SRC emacs-lisp
   (use-package buffer-move
     :ensure t
     :bind
     ("<C-S-up>" . 'buf-move-up))

   #+END_SRC

* Personal functions
** Open styles.js (F5)
   #+BEGIN_SRC emacs-lisp
     (defun openStyles ()
       "Open styles file in new window if it exists.."
       (interactive)
       (if (file-exists-p (concat default-directory "styles.js"))
	   (progn
	     (split-window-right)
	     (find-file-other-window (concat default-directory "styles.js"))
	   )
	 (message default-directory)))

     (global-set-key [f5] 'openStyles)
   #+END_SRC

** Open emacs path (C-x C-a)
   #+BEGIN_SRC emacs-lisp
     (global-set-key (kbd "C-x C-a")  (lambda () (interactive)
					  (cd "~/.emacs.d/")
					  (call-interactively 'find-file)))
  #+END_SRC

* Org-mode
** Shortcuts default
   #+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-c l") 'org-store-link)
(global-set-key (kbd "C-c a") 'org-agenda)
(global-set-key (kbd "C-c c") 'org-capture)
   #+END_SRC
** Templates
*** For Work
    #+BEGIN_SRC emacs-lisp
      (setq org-capture-templates
      '(("t" "Todo" entry (file "e:/programing/emacs_data/sprints.org")
      "* TODO %^{Description} \n %? \n :LOGBOOK:\n - Added: %U \n :END:" :empty-lines 1))
      )
    #+END_SRC
** Org TODO settings
   #+BEGIN_SRC emacs-lisp
     (setq org-todo-keywords
	   '((sequence "TODO" "BLOCKED" "REVIEW" "|" "DONE")))

     (setq org-log-done 'time)
     ;;(setq org-log-done 'note)

     (setq org-todo-keyword-faces
	   '(("TODO" . "yellow") ("NEXT" . "white") ("WAITING" . "orange")
	     ("DELAYED" . (:foreground "red" :weight bold))
             ("DONE" . "green") ("CANCELLED" . "grey")))
   #+END_SRC
** Done when children are done
   #+BEGIN_SRC emacs-lisp
     (defun org-summary-todo (n-done n-not-done)
       "Switch entry to DONE when all subentries are done, to TODO otherwise."
       (let (org-log-done org-log-states)   ; turn off logging
	 (org-todo (if (= n-not-done 0) "DONE" "TODO"))))

     (add-hook 'org-after-todo-statistics-hook 'org-summary-todo)
   #+END_SRC





